Tekla Open API Reference for Tekla Structures 2025
Arc Constructor (ViewBase, Point, Point, Double, Arc.ArcAttributes)
 Creates a new arc instance with the given two points, radius and specified attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Arc(
	ViewBase inView,
	Point inPoint1,
	Point inPoint2,
	double inRadius,
	Arc.ArcAttributes inAttributes
)
Public Sub New (
	inView As ViewBase,
	inPoint1 As Point,
	inPoint2 As Point,
	inRadius As Double,
	inAttributes As Arc.ArcAttributes
)
Parameters
inView
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
inPoint1
Type: Tekla.Structures.Geometry3d.Point
The start point to be used.
inPoint2
Type: Tekla.Structures.Geometry3d.Point
The end point to be used.
inRadius
Type: System.Double
The radius to be used.
inAttributes
Type: Tekla.Structures.Drawing.Arc.ArcAttributes
The arc attributes to be used.
See Also
Reference
Arc Class
Arc Overload
Tekla.Structures.Drawing Namespace